presReglasGenerales.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Reglas generales para el curso</title>
<meta name="author" content="(Juan E. Gómez-Morantes, PhD)"/>
<link rel="stylesheet" href="./reveal.js-3.9.2/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js-3.9.2/css/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Reglas generales para el curso</h1><h2 class="author">Juan E. Gómez-Morantes, PhD</h2><h2 class="date">28-Jul-2020</h2><p class="date">Created: 2020-07-30 Thu 15:28</p>
</section>

<section>
<section id="slide-org9bee117">
<h2 id="org9bee117">Datos de contacto</h2>
<div class="outline-text-2" id="text-org9bee117">
</div>
</section>
</section>
<section>
<section id="slide-orga456bc4">
<h3 id="orga456bc4">El profesor</h3>
<p>
Juan Erasmo Gómez
</p>

<p>
je.gomezm@javeriana.edu.co
</p>

<p>
Oficina: Segundo piso del edificio José Gabriel Maldonado (11)
</p>

<p>
Horario de atención: En cualquier momento de forma presencial (verificar calendario en outlook) o por MS Teams (verificar estado).
</p>

<aside class="notes">
<p>
Test de notas
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">tabla</td>
<td class="org-right">asd;lkf</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

</aside>

</section>
</section>
<section>
<section id="slide-orga63a88c">
<h2 id="orga63a88c">Entregas</h2>
<div class="outline-text-2" id="text-orga63a88c">
</div>
</section>
</section>
<section>
<section id="slide-org5125cb3">
<h3 id="org5125cb3">Reglas de entrega</h3>
<ol>
<li>No se aceptan entregas por fuera de los tiempos estipulados en los links de entregas en UVirtual.</li>
<li>No se aceptan links a documentos en Office 365, Google drive u otras plataformas cloud como entrega.</li>
<li>Sólo se aceptan entregas en formato PDF.</li>
<li>La forma (ortografía, formato, redacción, etc.) es importante. Esto se tomará en cuenta a la hora de calificación.</li>
<li>El tiempo de asignado para presentaciones debe ser respetado.</li>

</ol>

</section>
</section>
<section>
<section id="slide-org6708812">
<h2 id="org6708812">Asistencia a clase</h2>
<div class="outline-text-2" id="text-org6708812">
</div>
</section>
</section>
<section>
<section id="slide-org31f354e">
<h3 id="org31f354e">Política general</h3>
<p>
La asistencia a clase es fundamental para el buen desempeño en el curso
</p>
</section>
</section>
<section>
<section id="slide-org1e77c3d">
<h3 id="org1e77c3d">¿Qué constituye una inasistencia justificada?</h3>
<ol>
<li>Me quedé dormido y no alcancé a llegar a la clase</li>
<li>Tenía parcial/entrega de otra materia y tenía que dedicarle tiempo a eso</li>
<li>Se me alargó el chico de billar y se me pasó el tiempo</li>
<li>Estaba acompañando/visitando a un familiar enfermo</li>
<li>Tenía una cita médica</li>
<li>Una incapacidad médica</li>
<li>El cumpleaños de mi novia/novio</li>
<li>La Champions</li>
<li>El entierro de un familiar</li>
<li>Había mucho trancón</li>

</ol>

</section>
</section>
<section>
<section id="slide-org2aca6b6">
<h3 id="org2aca6b6">La inasistencia (no justificada) a clase implica las siguientes situaciones:</h3>
<ol>
<li>No entregar una tarea que se había dejado en clase ya que no sabía que se había hecho en la clase a la que falté</li>
<li>Que se me repita un quiz/taller/trabajo en clase</li>
<li>Que el quiz/taller/trabajo en clase que no hice no se me tome en cuenta dentro de la nota final del curso</li>
<li>Que el profesor me repita el contenido de la clase a la que falté por fuera del horario de clase</li>
<li>No responder preguntas de parcial relacionadas con los temas de la clase a la que falté</li>
<li>Todas las anteriores</li>
<li>Sólo la 2 y la 4</li>
<li>Ninguna de las anteriores</li>

</ol>
</section>
</section>
<section>
<section id="slide-orgba2c1a2">
<h3 id="orgba2c1a2">Cuando falto a una clase (con o sin justificación) tengo que:</h3>
<ol>
<li>Preguntarle a mis compañeros o al profesor qué se hizo en esa clase</li>
<li>Leer por mi cuenta las lecturas asignadas a esa clase</li>
<li>No hacer nada. Todo va a estar bien</li>
<li>Sólo la 1 y la 2</li>
<li>Todas la anteriores</li>
<li>Ninguna de las anteriores</li>

</ol>

</section>
</section>
<section>
<section id="slide-org0cc79ae">
<h2 id="org0cc79ae">Puntualidad</h2>
<div class="outline-text-2" id="text-org0cc79ae">
</div>
</section>
</section>
<section>
<section id="slide-org175ac1a">
<h3 id="org175ac1a">La falta de puntualidad:</h3>
<ol>
<li>Entorpecen el desarrollo de la clase</li>
<li>Distrae a compañeros y al profesor</li>
<li>Es una falta de respeto con todos los involucrados</li>

</ol>
</section>
</section>
<section>
<section id="slide-orgbfeda95">
<h3 id="orgbfeda95">Reglas generales de inicio de clase</h3>
<ol>
<li>La clase empieza 5 minutos después de la hora oficial de inicio</li>
<li>Si llegan tarde, háganlo en silencio</li>
<li>10 minutos es más que suficiente para llegar a clase</li>
<li>“Nunca lleguen tarde con un café en la mano”</li>

</ol>
</section>
</section>
<section>
<section id="slide-orgbb94d1e">
<h3 id="orgbb94d1e">Tiempos de presentaciones grupales</h3>
<ol>
<li>Los tiempos de presentaciones grupales tienen que ser respetados estrictamente</li>
<li>Miembros del grupo que no estén presentes al <b>inicio</b> de las presentaciones se asumirán como no-participantes en la misma.</li>

</ol>

</section>
</section>
<section>
<section id="slide-orgf3a99c5">
<h2 id="orgf3a99c5">Clases remotas</h2>
<div class="outline-text-2" id="text-orgf3a99c5">
</div>
</section>
</section>
<section>
<section id="slide-org448d8b8">
<h3 id="org448d8b8">Grabación de clases</h3>
<ul>
<li>Las clases van a ser grabadas por el profesor</li>
<li>Publicación en youtube por link privado</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgb4c1b2f">
<h3 id="orgb4c1b2f">Logística de clase</h3>
<ul>
<li>Uso de plataforma Blackboard (UVirtual) para clases</li>
<li>Uso de plataforma Microsoft Teams para comunicación</li>
<li><b>Reportar cualquier problema que tengan con las herramientas usadas durante el curso</b></li>

</ul>
</section>
</section>
<section>
<section id="slide-org43fc7cd">
<h3 id="org43fc7cd">Casos de bajo ancho de banda</h3>
<ul>
<li>Uso de Blackboard por teléfono fijo (<b>Verificar plan de telefonía previamente</b>)</li>
<li>Las presentaciones publicadas como archivo html pueden ser controladas por el profesor</li>

</ul>
</section>
</section>
<section>
<section id="slide-orge225cbd">
<h3 id="orge225cbd">Otra</h3>
<p>
Por favor complete el siguiente <a href="https://forms.office.com/Pages/ResponsePage.aspx?id=Dpn32j-KnECbdipUdQmAAEmnvpiiv5NJiO5NP8x0bFRUOElJM1I4RVBXNU1XNkRHMUpLU1c2TVBDNC4u">formulario</a>.
</p>
</section>
</section>
</div>
</div>
<script src="./reveal.js-3.9.2/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
slideNumber:true, width:1200, height:800, margin: 0.1, minScale:0.2, maxScale:2.5, transition:'cube',
multiplex: {
    secret: '1596140475781522276', // null if client
    id: '3216e4fb0fef26fd', // id, obtained from socket.io server
    url: 'https://reveal-js-multiplex-ccjbegmaii.now.sh' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
{ src: 'https://cdn.jsdelivr.net/npm/reveal.js-chalkboard@1.0.0/chalkboard.js' },,
 { src: './reveal.js-3.9.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
,
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/socket.io/2.2.0/socket.io.js', async: true },
 { src: './reveal.js-3.9.2/plugin/multiplex/master.js', async: true }]
});
</script>
</body>
</html>
